levizh/hc32m423/ddl/hc32m423_ddl/driver/inc/hc32m423_timera.h
/**
 *******************************************************************************
 * @file  hc32m423_timera.h
 * @brief This file contains all the functions prototypes of the TimerA driver
 *        library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-02-05       Yangjp          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */
#ifndef __HC32M423_TIMERA_H__
#define __HC32M423_TIMERA_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_common.h"
#include "ddl_config.h"

/**
 * @addtogroup HC32M423_DDL_Driver
 * @{
 */

/**
 * @addtogroup DDL_TIMERA
 * @{
 */

#if (DDL_TIMERA_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup TIMERA_Global_Types TimerA Global Types
 * @{
 */

/**
 * @brief TimerA initialization structure definition
 */
typedef struct
{
    uint16_t u16CountMode;              /*!< Specifies the TimerA count mode.
                                             This parameter can be a value of @ref TIMERA_Count_Mode */

    uint16_t u16CountDir;               /*!< Specifies the TimerA count direction.
                                             This parameter can be a value of @ref TIMERA_Count_Direction */

    uint16_t u16SyncStart;              /*!< Specifies the TimerA synchronous start.
                                             This parameter can be a value of @ref TIMERA_Sync_Start */

    uint16_t u16ClkDiv;                 /*!< Specifies the TimerA Count clock division.
                                             This parameter can be a value of @ref TIMERA_Clock_Division */

    uint16_t u16PeriodVal;              /*!< Specifies the TimerA period value.
                                             This parameter can be a value of half-word */

    uint16_t u16OverflowAction;         /*!< Specifies the Stop/continue count when TimerA count overflow.
                                             This parameter can be a value of @ref TIMERA_Overflow_Control */

    uint16_t u16HwStartCondition;       /*!< Specifies the TimerA hardware trigger start count condition.
                                             This parameter can be any value of @ref TIMERA_Hardware_Start_Count_Condition */

    uint16_t u16HwStopCondition;        /*!< Specifies the TimerA hardware trigger stop count condition.
                                             This parameter can be any value of @ref TIMERA_Hardware_Stop_Count_Condition */

    uint16_t u16HwClearCondition;       /*!< Specifies the TimerA hardware trigger clear count condition.
                                             This parameter can be any value of @ref TIMERA_Hardware_Clear_Count_Condition */

    uint16_t u16HwUpCondition;          /*!< Specifies the TimerA hardware trigger count up condition.
                                             This parameter can be any value of @ref TIMERA_Hardware_Count_Up_Condition */

    uint16_t u16HwDownCondition;        /*!< Specifies the TimerA hardware trigger count down condition.
                                             This parameter can be any value of @ref TIMERA_Hardware_Count_Down_Condition */

    uint16_t u16TrigFilterState;        /*!< Specifies the TimerA TRIG Port noise filter state.
                                             This parameter can be a value of @ref TIMERA_TRIG_Port_Filter_State */

