levizh/hc32m423/ddl/hc32m423_ddl/driver/inc/hc32m423_timera.h
/* Initialization and configuration TimerA output compare functions */
en_result_t TIMERA_OC_DeInit(M4_TMRA_TypeDef *TMRAx,
                             uint8_t u8Channel);
en_result_t TIMERA_OC_Init(M4_TMRA_TypeDef *TMRAx, uint8_t u8Channel,
                           const stc_timera_oc_init_t *pstcOcInit);
en_result_t TIMERA_OC_StructInit(stc_timera_oc_init_t *pstcOcInit);
void TIMERA_OC_SetCompare(M4_TMRA_TypeDef *TMRAx, uint8_t u8Channel,
                          uint16_t u16Value);
void TIMERA_OC_PwmCmd(M4_TMRA_TypeDef *TMRAx, uint8_t u8Channel,
                      en_functional_state_t enNewSta);
void TIMERA_OC_SetStartCountOutputPolarity(M4_TMRA_TypeDef *TMRAx,
                                           uint8_t u8Channel,
                                           uint16_t u16Polarity);
void TIMERA_OC_SetStopCountOutputPolarity(M4_TMRA_TypeDef *TMRAx,
                                          uint8_t u8Channel,
                                          uint16_t u16Polarity);
void TIMERA_OC_SetCmpMatchOutputPolarity(M4_TMRA_TypeDef *TMRAx,
                                         uint8_t u8Channel,
                                         uint16_t u16Polarity);
void TIMERA_OC_SetPeriodMatchOutputPolarity(M4_TMRA_TypeDef *TMRAx,
                                            uint8_t u8Channel,
                                            uint16_t u16Polarity);
void TIMERA_OC_SetForceOutputPolarity(M4_TMRA_TypeDef *TMRAx,
                                      uint8_t u8Channel,
                                      uint16_t u16Polarity);
en_result_t TIMERA_OC_CacheCmd(M4_TMRA_TypeDef *TMRAx,
                               uint8_t u8Channel,
                               en_functional_state_t enNewSta);
en_result_t TIMERA_OC_SetCacheTransmitCondition(M4_TMRA_TypeDef *TMRAx,
                                                uint8_t u8Channel,
                                                uint16_t u16Condition);

/* Interrupts and flags management functions */
void TIMERA_IntCmd(M4_TMRA_TypeDef *TMRAx, uint16_t u16IntSource,
                   en_functional_state_t enNewSta);
en_flag_status_t TIMERA_GetFlag(M4_TMRA_TypeDef *TMRAx, uint16_t u16Flag);
void TIMERA_ClearFlag(M4_TMRA_TypeDef *TMRAx, uint16_t u16Flag);


/**
 * @}
 */

#endif /* DDL_TIMERA_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32M423_TIMERA_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
